analysis/results/cassandra/log_cassandra_a_run3.txt
/opt/java/openjdk/bin/java -cp /opt/ycsb/cassandra-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/core-0.17.0.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/opt/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/opt/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/opt/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/opt/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/opt/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -P /workloads/workload_a.properties -p hosts=cass1,cass2,cass3 -p cassandra.keyspace=ycsb -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -t
Command line: -db site.ycsb.db.CassandraCQLClient -P /workloads/workload_a.properties -p hosts=cass1,cass2,cass3 -p cassandra.keyspace=ycsb -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -t
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by io.netty.util.internal.PlatformDependent0 (file:/opt/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar) to field java.nio.Buffer.address
WARNING: Please consider reporting this to the maintainers of io.netty.util.internal.PlatformDependent0
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
May 23, 2026 8:37:45 AM io.netty.util.internal.PlatformDependent <clinit>
INFO: Your platform does not provide complete low-level API for accessing direct buffers reliably. Unless explicitly requested, heap buffer will always be preferred to avoid potential system unstability.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
[OVERALL], RunTime(ms), 249046
[OVERALL], Throughput(ops/sec), 4015.3224705476096
[TOTAL_GCS_G1_Young_Generation], Count, 46
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 660
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.26501128305614224
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 46
[TOTAL_GC_TIME], Time(ms), 660
[TOTAL_GC_TIME_%], Time(%), 0.26501128305614224
[READ], Operations, 500519
[READ], AverageLatency(us), 4767.753777578873
[READ], MinLatency(us), 491
[READ], MaxLatency(us), 1323007
[READ], 95thPercentileLatency(us), 11455
[READ], 99thPercentileLatency(us), 31199
[READ], Return=OK, 500519
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 141517.75
[CLEANUP], MinLatency(us), 5
[CLEANUP], MaxLatency(us), 2265087
[CLEANUP], 95thPercentileLatency(us), 100
[CLEANUP], 99thPercentileLatency(us), 2265087
[UPDATE], Operations, 499481
[UPDATE], AverageLatency(us), 2952.699704293056
[UPDATE], MinLatency(us), 305
[UPDATE], MaxLatency(us), 905727
[UPDATE], 95thPercentileLatency(us), 6975
[UPDATE], 99thPercentileLatency(us), 22783
[UPDATE], Return=OK, 499481